Show / Hide Table of Contents
Class Tools
Inheritance
System.Object
Tools
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaStatiCa.Plugin
Assembly: IdeaStatiCa.Plugin.dll
Syntax
public static class Tools
Methods
Improve this Doc   View Source
ConnectionDataFromXml(String)
Declaration
public static ConnectionData ConnectionDataFromXml(string xml)
Parameters
 Type |  Name |  Description
 System.String |  xml
Returns
 Type |  Description
 ConnectionData
Improve this Doc   View Source
ConnectionDataToXml(ConnectionData)
Declaration
public static string ConnectionDataToXml(ConnectionData model)
Parameters
 Type |  Name |  Description
 ConnectionData |  model
Returns
 Type |  Description
 System.String
Improve this Doc   View Source
ModelFromXml(String)
Declaration
public static ModelBIM ModelFromXml(string xml)
Parameters
 Type |  Name |  Description
 System.String |  xml
Returns
 Type |  Description
 ModelBIM
Improve this Doc   View Source
ModelsFromXml(String)
Declaration
public static List<ModelBIM> ModelsFromXml(string xml)
Parameters
 Type |  Name |  Description
 System.String |  xml
Returns
 Type |  Description
 System.Collections.Generic.List<ModelBIM>
Improve this Doc   View Source
ModelToXml(ModelBIM)
Declaration
public static string ModelToXml(ModelBIM model)
Parameters
 Type |  Name |  Description
 ModelBIM |  model
Returns
 Type |  Description
 System.String
Improve this Doc   View Source
ModelToXml(List<ModelBIM>)
Declaration
public static string ModelToXml(List<ModelBIM> model)
Parameters
 Type |  Name |  Description
 System.Collections.Generic.List<ModelBIM> |  model
Returns
 Type |  Description
 System.String
Improve this Doc   View Source
OpenModelContainerFromXml(String)
Declaration
public static OpenModelContainer OpenModelContainerFromXml(string xml)
Parameters
 Type |  Name |  Description
 System.String |  xml
Returns
 Type |  Description
 OpenModelContainer
Improve this Doc   View Source
OpenModelContainerToXml(OpenModelContainer)
Declaration
public static string OpenModelContainerToXml(OpenModelContainer model)
Parameters
 Type |  Name |  Description
 OpenModelContainer |  model
Returns
 Type |  Description
 System.String
Improve this Doc   View Source
ProjectFromXml(String)
Declaration
public static BIMProject ProjectFromXml(string xml)
Parameters
 Type |  Name |  Description
 System.String |  xml
Returns
 Type |  Description
 BIMProject
Improve this Doc   View Source
ProjectToXml(BIMProject)
Declaration
public static string ProjectToXml(BIMProject project)
Parameters
 Type |  Name |  Description
 BIMProject |  project
Returns
 Type |  Description
 System.String
 Improve this Doc
 View Source